:PROPERTIES:
:ID:       f90d1c45-3994-4191-b98a-8230162bfc60
:END:
* Current Boards
** Miscellaneous Elisp Scripts
:PROPERTIES:
:CATEGORY: Elisp
:END:
| Done | Test (Active) | Dev (Done) | Dev (Track) | Dev (Active) | Analysis (Done) | Analysis (Active) |
|------+---------------+------------+-------------+--------------+-----------------+-------------------|
|      |               |            |             |              |                 | [[Export script]]     |
|      |               |            |             |              |                 |                   |
*** Backlog
**** TODO Add references sections
**** TODO Export script
Add publishing script to init.el and a batch file for headless runs.
**** TODO LaTeX SVG
Hook function to replace MathML with SVG on Org to HTML exports (assuming ready-made automated solutions don't exist).
Turns out ~#+OPTIONS: tex:imagemagick~ or ~tex:dvisvgm~ should do the trick.
Ready-made solution already existed.
**** TODO Backup init.el
Add original init and literate init template to Git.
**** TODO Literate port
Port eveything to literate config.
**** TODO Tutorial notes
Finish Org variable & DevOps tutorials.
**** TODO Headless HTML export script with emacs-nox
**** TODO Send time data to Org spreadsheets with completion times + task tags exportable to more portable CSVs later
** Miscellaneous dwm Patches
:PROPERTIES:
:CATEGORY: dwm
:END:
*** Backlog
**** TODO Rebind Alt to Super in main config
**** TODO Rebind Shift+Super to Ctrl+Super in third-party swap script
** Miscellaneous Nix Flakes
:PROPERTIES:
:CATEGORY: Nix
:END:
*** Backlog
**** TODO Fork and update Dart-Sass flake
** C++ Testbed App
:PROPERTIES:
:CATEGORY: Cpp
:END:
*** Backlog
**** TODO Set up a C++ timekeeper test app with <chrono>
**** TODO Construct a Nix package to handle deps
**** Makefile ported from Meson
**** s7 Scheme scripting language integration
**** Dear ImGui integration
**** Bullet physics integration
**** Boost Graph Library (BGL) integration
**** Compile tangled notes with info from Caleb Curry & javidx9's C++ tutorials (for later reference)
**** Software renderer for 3D graphics
**** CUDA environment with Nix for porting (use Thrust and possibly its ROCm port instead of CUDA directly)
- https://thrust.github.io/
- https://github.com/RyanCargan/thrender (forked from another dev)
  Example by another dev using Thrust, GLM and Assimp.
  Consider adding SDL2 with Dear ImGui on a software renderer similar to the example below.
- https://github.com/RyanCargan/imgui_software_renderer (forked from another dev again)
- Use your R3F setup as a reference for future designs.
- Bullet integration and CSG implementation next?
** React Site
:PROPERTIES:
:CATEGORY: React
:END:
*** Backlog
**** TODO React landing page
**** TODO Deno subdirectory
**** TODO Merge with Org exports
** Go Server
:PROPERTIES:
:CATEGORY: Golang
:END:
*** Backlog
**** TODO Server set up according to reference book
* Backburner
** TensorFlow.js App
*** Backlog
**** TODO Client-side speech & gesture recongnition setup
** Miscellaneous Python Scripts
*** Backlog
**** TODO Merge Bullet exporter addon forks for Blender
**** TODO Graph extractor scripts for Org files
**** TODO Math scripts (get help from the playlist for math with Python that I forgot the name of for now)
- Combine with LaTeX snippets and literate programming for easy reference later.
- Use /How to Prove It: A Structured Approach/ and Spivak's /Calculus/ as references.
- Make use of shared variables between different Python code blocks and LaTeX snippets.
**** TODO Transfer learning with PyTorch & SpaCy
** MariaDB Analytics Service
*** Backlog
**** TODO Set up with Nix
** Android Kotlin JNI Testbed App
*** Backlog
**** TODO Follow fCC's 2 part series (and selectively use info as needed)
* Archived Boards
Three most recent projects archived here.
Older projects go in separate files.
** ?
** ?
** ?
* Misc
** Template Project
| Done | Test (Active) | Dev (Done) | Dev (Track) | Dev (Active) | Analysis (Done) | Analysis (Active) | Backlog |
|------+---------------+------------+-------------+--------------+-----------------+-------------------+---------|
|      |               |            |             |              |                 |                   | [[Test 1]]  |
|      |               |            |             |              |                 |                   | [[Test 2]]  |
*** Backlog
**** TODO Test 1
<2022-04-24 Sun 08:00>
**** TODO Test 2
:LOGBOOK:
CLOCK: [2022-04-23 Sat 22:37]--[2022-04-23 Sat 22:38] =>  0:01
:END:
**** TODO Test 3
:LOGBOOK:
CLOCK: [2022-04-23 Sat 22:38]--[2022-04-23 Sat 22:38] =>  0:00
:END:
**** TODO Test 4
:LOGBOOK:
CLOCK: [2022-04-23 Sat 22:50]--[2022-04-24 Sun 20:53] => 22:03
:END:
*** Tasks
